Model: "sequential_8"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 dense_24 (Dense)            (None, 256)               196864    
                                                                 
 dropout_8 (Dropout)         (None, 256)               0         
                                                                 
 dense_25 (Dense)            (None, 128)               32896     
                                                                 
 dense_26 (Dense)            (None, 1)                 129       
                                                                 
=================================================================
Total params: 229889 (898.00 KB)
Trainable params: 229889 (898.00 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________